### Import der Tabelle "Spanische Autoren"

In [1]:
import pandas as pd
import math

sp_authors = pd.read_csv("sp_authors.tsv", sep="\t")
sp_authors.head()

,id,author-fullname,author,birth,death,gender,pages-in-manual,novels,works,life-span,digitzed-by
0,1,Rosalía de Castro,RdCastro,1837,1885,female,17,1,1,48,6
1,2,Enrique Pérez Escrich,Escrich,1829,1897,male,1,4,17,68,5
2,3,Antonio de Trueba y de la Quintana,Trueba,1819,1889,male,1,0,1,70,6
3,4,José Selgas Carrasco,Selgas,1822,1882,male,1,5,7,60,4
4,5,Francisco Navarro Villoslada,Villoslada,1818,1895,male,1,0,0,77,5

#### Ausgabe

In [2]:
#sp_authors["life-span"]
sp_authors["life-span"][0:10]

0    48
1    68
2    70
3    60
4    77
5    68
6    58
7    58
8    73
9    81
Name: life-span, dtype: int64

..als Liste

In [3]:
print(sp_authors["life-span"].values.tolist(), end=" ")

[48, 68, 70, 60, 77, 68, 58, 58, 73, 81, 77, 70, 49, 85, 64, 71, 66, 61, 47, 98, 52, 66, 78, 56, 80, 48, 63, 62, 47, 82, 46, 65, 62, 80, 52, 51, 85, 67, 72, 84, 94, 51, 82, 75, 83, 71, 90, 80, 55, 59, 51, 59, 55, 66, 56, 73, 66, 55, 54, 59, 73, 63, 88, 61, 78, 78, 42, 48, 41, 75, 83, 88, 85, 81, 86, 62, 79, 52, 42, 66, 34, 85, 51, 72, 84, 92, 73, 60, 88, 81, 36, 54, 71, 70, 72, 65, 75, 74, 60, 74, 59, 39, 92, 68, 77, 36, 61, 83, 32, 65, 84, 64, 65, 60, 61, 90, 68, 53, 96, 81, 103, 60, 65, 84, 71, 86, 68, 86, 72, 70, 80, 49, 53]

### Import eigener Tabelle

Eine Liste deutscher Kinderbuchautoren, die im 20. Jhdt geboren wurden.

In [4]:
gerChB_authors = pd.read_csv("KinderautorenD20Jhdt.tsv", sep="\t")
gerChB_authors.head()

          Nachname    Vorname  Geburtsjahr  Todesjahr
0          Abraham      Peter         1936       2015
1          Aichner   Fridolin         1912       1987
2  Alexander-Burgh   Eberhard         1929       2004
3          Allfrey  Katherine         1910       2001
4             Axt       Maria         1926       1986

In [5]:
gerChB_authors["Lebensspanne"] = gerChB_authors["Todesjahr"] - gerChB_authors["Geburtsjahr"]
gerChB_authors.head()

          Nachname    Vorname  Geburtsjahr  Todesjahr  Lebensspanne
0          Abraham      Peter         1936       2015            79
1          Aichner   Fridolin         1912       1987            75
2  Alexander-Burgh   Eberhard         1929       2004            75
3          Allfrey  Katherine         1910       2001            91
4             Axt       Maria         1926       1986            60



#### Arithmetischer Mittelwert
der Lebensspanne der Autoren aus der Liste gerChB_authors

$ \overline{x} = \frac{1}{n} \sum \limits_{i = 1}^n {x_i} $

In [6]:
mean = gerChB_authors["Lebensspanne"].sum() / len(gerChB_authors)
print(mean)

75.45098039215686



#### Varianz/Standardabweichung
der Lebensspanne der Autoren aus der Liste gerChB_authors

$ s = \sqrt{\frac{1}{n-1} \sum \limits_{i = 1}^n (x_i - \overline{x})^2 } $

In [7]:
var = math.sqrt(
    sum(
        (gerChB_authors["Lebensspanne"] - mean)**2) /
        (len(gerChB_authors) - 1
    )
)
print(var)

12.098452339849418

In [8]:
AYL_theatre_data = pd.read_excel("AYLSpeakerData.xlsx")
AYL_theatre_data

    ID               label  gender  per_ms_sps         role importance
0    0             orlando    male         120  protagonist    primary
1    1              oliver    male          40   antagonist    primary
2    2      second brother    male           2        other      minor
3    3                adam    male          10        other      minor
4    4              dennis    male           2        other      minor
5    5            rosalind  female         201        lover    primary
6    6               celia  female         108        other  secondary
7    7          touchstone    male          74        other  secondary
8    8      duke frederick    male          20   antagonist  secondary
9    9             charles    male           8        other      minor
10  10             le beau    male          14        other      minor
11  11          first lord    male           1        other      minor
12  12         second lord    male           1        other      minor
13  13         duke senior    male          32        other  secondary
14  14              jaques    male          57        other  secondary
15  15              amiens    male          11        other      minor
16  16      first lord sen    male           6        other      minor
17  17     second lord sen    male           3        other      minor
18  18          first page    male           4        other      minor
19  19         second page    male           3        other      minor
20  20               corin    male          24        other      minor
21  21             silvius    male          24        other      minor
22  22              phoebe  female          23        other      minor
23  23              audrey  female          12        other      minor
24  24             william    male          11        other      minor
25  25  sir oliver martext    male           3        other      minor
26  26               hymen    male           2        other      minor

In [9]:
AYL_theatre_data["per_ms_sps"].mean()

30.22222222222222